package Study;

public class VarEx4 {

	public static void main(String[] args) {
		
		// 연산자란?
		// 어떠한 기능 또는 대상체에 계산과 같은 처리를 수행하는 문자 또는 기호라고 볼 수있다.
		// 연산자(oprator) - 어떠한 기능을 수행하는 기호(+ ,- ,* ,/ , % 등)
		// 피연산자(operand) - 연산자의 작업 대상(변수, 상수, 수식 등)
		
		// 연산자의 종류
		// 연산자는 산술연산자, 비교연산자, 논리연산자, 대입연산자가 있음.
		
		// 산술연산자의 종류(+ ,- ,* ,/ , %)
		// % = 나머지, / = 나누기
		// 비교연산자의 종류(>, <, >=, <=, ==, !=)
		// != = 아니거나같다. , == = 둘다 같다.
		// 논리연산자의 종류(&&, ||, !)
		// 대입연산자 (=)
	
		//instanceof는 객체타입을 확인하는데 사용한다.

		//속성은 연산자이고 형변환이 가능한지 해당 여부를 true or false로 가르쳐준다.
		//instanceof를 이용한 연산결과로 true를 얻었다는 것은 참조변수가 검사한 타입으로 형변환이 가능하다는 것을 뜻한다.
		//부모 클래스(A)보다 자식 클래스(B)는 더 많은 기능을 담고 있다.
		//그러므로 자식 클래스(B)는 부모 클래스(A)로 형변환이 가능하다.

	}

}





















