package Study;

public class Java {

	// 자바란? 
	// 프로그래밍 언어이다.
	// 컴퓨터 프로그램을 만드는데 사용된다.
	// 실행환경(JRE) + 개발도구(JDK) + 라이브러리(API)
	
	// 라이브러리란?
	// 프로그램을 만드는데 필요한 기능들을 만들어 놓은 것 을 말한다.
	
	// 라이브러리를 사용하면 쉽고 빠르게 만들수있다.
	
	// 자바의 특징
	// 1. 배우기 쉬운 객체지향 언어
	// 자동 메모리 관리
	// 멀티 쓰레드(하나의 프로그램에서 동시에 여러 작업을 할 수 있는것을 말함)를 지원함.
	// 풍부한 라이브러리로 쉽게 개발가능
	// 운영체제에 독립적이다.
	
	// 컴파일러란?
	// 사람이 작성한 문장을 기계어로 번역하는것을 말함
	
	// 자바 클래스란?
	// 자바 프로그램의 단위. 자바 프로그램은 클래스들로 구성되어있다.
	
	// main메서드란?
	// 자바 프로그램의 시작점. 이 메서드 없이 실행불가하다.
	
	// 단축키
	// ctrl + shift + L 단축키 전체 목록보기
	// ctrl + D 한 줄 삭제
	// alt + shift + A 멀티컬럼 편집
	
}
