package Study;

public class VarEx1 {

	public static void main(String[] args) {
		
		// 변수(varible)란?
		// 하나의 값을 저장할 수 있는 메모리 공간
		
		// 변수의 종류
		
		// 클래스 변수
		// 인스턴스 변수
		// 지역 변수 - 읽기 전에 꼭 초기화를 해야 함.
		
		// 변수의 선언
		// 값(data)을 저장할 공간을 마련하기 위해서
		
		// 변수의 선언 방법
		// 변수타입 변수이름;
		//    int     age   ;   
		// 정수(int)타입의 변수 age를 선언
		
		// 변수에 값 저장하기
		// 1. 변수에 값 저장하기
		//	int age; // 정수(int)타입의 변수 age를 선언
		//  age = 25; // 변수 age에 25를 저장
		//	int age = 25; // 위의 두줄을 한 줄로 바꿀수 있음.
		
		// 변수의 초기화란?
		// 변수에 처음으로 값을 저장하는 것
		
		//int x = 0;		변수 x를 선언 후, 0으로 초기화
		//int y = 5;		변수 y를 선언 후, 5로 초기화
		int x = 0, y = 5;	// 위의 두 줄을 한줄로
		
		// 변수의 타입
		
		// 1. 변수의 타입은 저장할 값의 타입에 의해 결정된다.
		int age = 25;
		// int, age는 정수타입으로 일치해야한다.
		// 2. 저장할 값의 타입과 일치하는 타입으로 변수를 선언
		char ch = '가'; // char는 문자 타입
		double pi = 3.14; //double은 실수 타입
		
		// 값(data)의 타입
		// 값(data)의 종류는 문자와 숫자(정수,실수)로 나누어 진다.
		
		// 문자는 '가','나','다','라'
		// 숫자는 정수와 실수로 나누어 지는데 
		// 문자는 char
		// 정수는 byte, short, int, long
		// 실수는 float, double
		// 논리는 boolean - (true, false)
		// 자바에서는 값의 종류에 따라 8개의 타입이 있는데 기본타입이라고 한다.
		
		
		
		
	}

}





















